### Resultado del Terraform Plan:
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # azurerm_container_registry.acajascr[0m will be created
[0m  [32m+[0m[0m resource "azurerm_container_registry" "acajascr" {
      [32m+[0m[0m admin_enabled                 = false
      [32m+[0m[0m admin_password                = (sensitive value)
      [32m+[0m[0m admin_username                = (known after apply)
      [32m+[0m[0m encryption                    = (known after apply)
      [32m+[0m[0m export_policy_enabled         = true
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "uksouth"
      [32m+[0m[0m login_server                  = (known after apply)
      [32m+[0m[0m name                          = "acajascr"
      [32m+[0m[0m network_rule_bypass_option    = "AzureServices"
      [32m+[0m[0m network_rule_set              = (known after apply)
      [32m+[0m[0m public_network_access_enabled = true
      [32m+[0m[0m resource_group_name           = "rg-acajas-dvfinlab"
      [32m+[0m[0m retention_policy              = (known after apply)
      [32m+[0m[0m sku                           = "Basic"
      [32m+[0m[0m trust_policy                  = (known after apply)
      [32m+[0m[0m zone_redundancy_enabled       = false
    }

[1m  # module.networks.azurerm_public_ip.pip[0m will be created
[0m  [32m+[0m[0m resource "azurerm_public_ip" "pip" {
      [32m+[0m[0m allocation_method       = "Dynamic"
      [32m+[0m[0m ddos_protection_mode    = "VirtualNetworkInherited"
      [32m+[0m[0m fqdn                    = (known after apply)
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m idle_timeout_in_minutes = 4
      [32m+[0m[0m ip_address              = (known after apply)
      [32m+[0m[0m ip_version              = "IPv4"
      [32m+[0m[0m location                = "uksouth"
      [32m+[0m[0m name                    = "pip-acajas"
      [32m+[0m[0m resource_group_name     = "rg-acajas-dvfinlab"
      [32m+[0m[0m sku                     = "Basic"
      [32m+[0m[0m sku_tier                = "Regional"
    }

[1m  # module.vms.azurerm_network_interface.nic_bd[0m will be created
[0m  [32m+[0m[0m resource "azurerm_network_interface" "nic_bd" {
      [32m+[0m[0m applied_dns_servers           = (known after apply)
      [32m+[0m[0m dns_servers                   = (known after apply)
      [32m+[0m[0m enable_accelerated_networking = false
      [32m+[0m[0m enable_ip_forwarding          = false
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m internal_dns_name_label       = (known after apply)
      [32m+[0m[0m internal_domain_name_suffix   = (known after apply)
      [32m+[0m[0m location                      = "uksouth"
      [32m+[0m[0m mac_address                   = (known after apply)
      [32m+[0m[0m name                          = "nic-bd"
      [32m+[0m[0m private_ip_address            = (known after apply)
      [32m+[0m[0m private_ip_addresses          = (known after apply)
      [32m+[0m[0m resource_group_name           = "rg-acajas-dvfinlab"
      [32m+[0m[0m virtual_machine_id            = (known after apply)

      [32m+[0m[0m ip_configuration {
          [32m+[0m[0m gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          [32m+[0m[0m name                                               = "ip-configuration-bd"
          [32m+[0m[0m primary                                            = (known after apply)
          [32m+[0m[0m private_ip_address                                 = "10.0.30.4"
          [32m+[0m[0m private_ip_address_allocation                      = "Static"
          [32m+[0m[0m private_ip_address_version                         = "IPv4"
          [32m+[0m[0m public_ip_address_id                               = (known after apply)
          [32m+[0m[0m subnet_id                                          = "/subscriptions/86f76907-b9d5-46fa-a39d-aff8432a1868/resourceGroups/final-project-common/providers/Microsoft.Network/virtualNetworks/vnet-common-bootcamp/subnets/sn-acajas"
        }
    }

[1m  # module.vms.azurerm_virtual_machine.vm_bd[0m will be created
[0m  [32m+[0m[0m resource "azurerm_virtual_machine" "vm_bd" {
      [32m+[0m[0m availability_set_id              = (known after apply)
      [32m+[0m[0m delete_data_disks_on_termination = false
      [32m+[0m[0m delete_os_disk_on_termination    = true
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m license_type                     = (known after apply)
      [32m+[0m[0m location                         = "uksouth"
      [32m+[0m[0m name                             = "vm-bd"
      [32m+[0m[0m network_interface_ids            = (known after apply)
      [32m+[0m[0m resource_group_name              = "rg-acajas-dvfinlab"
      [32m+[0m[0m vm_size                          = "Standard_B1ms"

      [32m+[0m[0m os_profile {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      [32m+[0m[0m os_profile_linux_config {
          [32m+[0m[0m disable_password_authentication = false
        }

      [32m+[0m[0m storage_image_reference {
          [32m+[0m[0m offer     = "0001-com-ubuntu-server-jammy"
          [32m+[0m[0m publisher = "Canonical"
          [32m+[0m[0m sku       = "22_04-lts"
          [32m+[0m[0m version   = "latest"
        }

      [32m+[0m[0m storage_os_disk {
          [32m+[0m[0m caching                   = "ReadWrite"
          [32m+[0m[0m create_option             = "FromImage"
          [32m+[0m[0m disk_size_gb              = (known after apply)
          [32m+[0m[0m managed_disk_id           = (known after apply)
          [32m+[0m[0m managed_disk_type         = "Standard_LRS"
          [32m+[0m[0m name                      = "myosdisk-bd"
          [32m+[0m[0m os_type                   = (known after apply)
          [32m+[0m[0m write_accelerator_enabled = false
        }
    }

[1mPlan:[0m 4 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```